{"milvets": ["Senior living in UAH here. It isn't a massive lift to get housing as a GSer, most of the people I know had a period where they didn't know what they were going to do but figured it out pretty quickly either through the university or by getting a roommate. \n\nOn the pricing: in my experience, a comparable one-bedroom to UAH prices is about $1500 more expensive on the general market. Your best bet if you live outside of university housing is to get a roommate and split the rent. That is by far the most economical decision I think you can make.", "I don't. But would you like a rucking partner?\n", "LOL hello Sang. Welcome to Reddit! It's better than Facebook for general question posting over the long-term because it's easier to actually find past posts. A year from now it will be pretty easy to search here for past discussions, while posts to our Facebook group will be completely buried and useless. Also, Reddit is better for discussion in general. \n\nYou should follow some subs, I recommend /r/pics /r/news /r/tifu /r/Army /r/hmmm /r/mildlyinteresting /r/interestingasfuck /r/showerthoughts /r/educationalgifs & /r/funny", "Cause whey protein makes for a great post-workout shake.", "I got it too. Could be an Air Force only thing.", "I get the same about once a month", "http://imgur.com/I5MMQYu", "[deleted]", "How difficult is the application process? \n\n\nWere you worried about competing against the main student body or were you separate since you're a veteran? \n\nWhat sort of things was the school looking for? \n\nHow are costs? How do you make ends meet? \n\n\n\n", "Are vets on the Post 9/11 GI Bill and Yellow Ribbon given institutional grants/scholarships?"], "barnard": ["I didn't apply to Columbia (and applied to/have chosen to attend Barnard) because Columbia has a really high-stress and high-pressure culture whereas Barnard is a more supportive community from what I've heard", "BC '20 and I love it here. I also didn't apply to Columbia because I wanted the women's college environment\n\nPros: \n- so much attention! from admin, professors, mentors, classmates, alumni, etc.\n- much more school spirit and community\n- Barnard students get most Columbia resources, but not the other way around. truly the best of both worlds\nCons: \n- snarky comments from CC boys \n- not much of a school rep if you're not from New England\n- can be lonely as a physical sciences or math major ", "I just graduated from Barnard in May of 2017 and it was truly the best choice! I thought I wanted to go to Columbia in HS but I visited Barnard and fell in love with the culture, the people and the overall vibe. I completely agree with the other comments - CC is super stressful and I found Barnard people to be more fun, chill and easier to connect with. Of course, everyone is different so a lot of other factors will play a role in what you prefer. I made a video about my experience at Barnard and things I learned from being there. Feel free to check it out, I hope it will be helpful for you one way or another https://www.youtube.com/watch?v=qvM2_Bqn9d4&t=1358s", "Class of 2012 alumna here. Loved the quad, which is where you'd live for at least freshman year. Some wings are nicer than others, but if you get a wing w no a/c, just make friends with someone in Sulz. :)\n\nI liked the food, especially the froyo and the salad bar. The kosher brownies were also really great.\n\nHope that helped! Feel free to PM w other questions.", "Hello! I applied early decision this year, and I'm waiting to hear back in the next few days. So, I can't tell you if what I did at the interview actually worked or not. I did interview though, so I'll tell you about what I experienced there.\n\nMy interviewer was a current senior. Even though the website says admissions officers OR seniors will interview you, she told me that seniors do all of the interviews. She was super friendly! They'll ask you things such as \"why Barnard?\" or \"Tell me about your extra curricular activities\".... you know, the obvious, usual questions. There was nothing that was unexpected. My tip for you is to go in there with good questions for your interviewer (it is supposed to be an equal exchange of information). I felt like I should have thought of better questions beforehand. Also, don't ask anything that you could find on their website! Show that you know a lot about the school already, and ask about her personal experiences there instead or maybe some more specific questions regarding YOUR future there at Barnard. \n\nOverall, I had a lovely experience there! I feel like Barnard is the absolute perfect school for me (which is why I applied ED..) I'll let you know if I got in when I hear back in a few days!  ", "I'm a current senior at Barnard and I come from a pretty low SES background. About 95% of my tuition is covered, a little is covered by loans and the most I've had to pay is about a grand for any given semester. \n\nThat being said, financial aid varies case to case and you might even be accepted into an academic program that comes with a scholarship/better financial aid at Barnard. Additionally, Barnard's FinAid advisors are extremely helpful and will do their best to accommodate. \n\nIf you have anymore questions about Barnard's financial aid package/anything else Barnard related, PM me. I'm happy to answer questions! \n\nEdit: Cost of living -- as a freshman, it's cheap to live on-campus. You get an unlimited meal plan your first year so if you ever buy food, it's going out or just snacks because you don't really need to cook for yourself. I usually spend about $40/wk on groceries and I frequent a lot of places on campus still. ", "I find this kind of funny with Columbia as the most stressful school in America lol", "I thought all 11 of you would appreciate knowing this. \n\nThough, to be honest, I don't always 100% feel the barnard love myself. Thoughts? "], "NarrateLikeIAmA": ["Not me but I like this one a lot\nPlayground P.I.: [http://youtu.be/GqW3WyZqwxc] (http://youtu.be/GqW3WyZqwxc) ", "http://vocaroo.com/i/s03PDKTRy1fO", "I wouldn't dare do an American accent in front of native speakers. But here is my attempt at a fictional 50s British prime-minister doing the announcement:  http://vocaroo.com/i/s0GHLVvtC0ay", "Bravo.", "Excellent work. ", "http://vocaroo.com/i/s0zv2IopPVTU", "More of the same - http://vocaroo.com/i/s1TtECgSABot"]}